cs291a_proj3_final/app/app/controllers/comments_controller.rb

    def create
      @comment = @post.comments.build(comment_params)

      if @comment.save
---
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "callie"], ["body", "f"], ["post_id", 56], ["created_at", "2023-10-28 21:39:56.053604"], ["updated_at", "2023-10-28 21:39:56.053604"], ["user_id", nil]]

    def set_user_and_post
      @user = User.find(params[:user_id])
      @post = @user.posts.find(params[:post_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 10], ["id", 55], ["LIMIT", 1]]

    def set_comment
      @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 56], ["id", 1], ["LIMIT", 1]]