cs291a_proj3_final/app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test4"], ["body", "test4"], ["user_id", 10], ["created_at", "2023-10-28 17:20:49.165414"], ["updated_at", "2023-10-28 17:20:49.165414"]]
---
    def create
      @post = @user.posts.build(post_params)

      if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "test1!"], ["updated_at", "2023-10-28 17:27:31.501130"], ["id", 53]]
---
    def update
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 10], ["id", 51], ["LIMIT", 1]]
---
    def set_post
      @post = @user.posts.find(params[:id])

SELECT "posts".* FROM "posts"
---
    def index
        #@user = User.find(params[:id])
        @posts = Post.all