cs291a_proj3_final/app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Callie"], ["created_at", "2023-10-28 18:58:59.158199"], ["updated_at", "2023-10-28 18:58:59.158199"], ["email", "f"]]

  def set_user
    if (@user = User.find_by_id(params[:id]).present?)
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]