cs291a_proj3_final/app/app/views/users/index.html.erb


Our blog has <%= User.count %> users and counting!
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"